CHANGELOG.md
- [Version 1.0.0 <span class="timestamp-wrapper"><span class="timestamp">[2025-12-28 Sun]</span></span>](#org99202c8)
- [Version 0.9.9 <span class="timestamp-wrapper"><span class="timestamp">[2025-03-19 Wed]</span></span>](#orgbe3a609)
- [Version 0.9.8 <span class="timestamp-wrapper"><span class="timestamp">[2024-12-31 Tue]</span></span>](#org4574465)
- [Version 0.9.7 <span class="timestamp-wrapper"><span class="timestamp">[2024-12-26 Thu]</span></span>](#org20e1d3c)
- [Version 0.9.5 <span class="timestamp-wrapper"><span class="timestamp">[2023-11-07 Tue]</span></span>](#org31e8a65)
- [Version 0.9.3 <span class="timestamp-wrapper"><span class="timestamp">[2023-05-24 Wed]</span></span>](#org842f384)
- [Version 0.9.2 <span class="timestamp-wrapper"><span class="timestamp">[2023-05-22 Mon]</span></span>](#orgf156f54)
- [Version 0.9.1 <span class="timestamp-wrapper"><span class="timestamp">[2023-05-22 Mon]</span></span>](#org2a66ab7)
- [Version 0.9.0 <span class="timestamp-wrapper"><span class="timestamp">[2023-05-22 Mon]</span></span>](#orgb45c20a)
- [Version 0.8.0 <span class="timestamp-wrapper"><span class="timestamp">[2023-04-20 Thu]</span></span>](#org5aaa371)
- [Version 0.7.0 <span class="timestamp-wrapper"><span class="timestamp">[2023-04-02 Sun]</span></span>](#org426e756)
- [Version 0.6.6 <span class="timestamp-wrapper"><span class="timestamp">[2023-01-09 Mon]</span></span>](#orgbea8e5d)
- [Version 0.6.3 <span class="timestamp-wrapper"><span class="timestamp">[2022-06-04 Sat]</span></span>](#orgab9a591)
- [Version 0.6.2 <span class="timestamp-wrapper"><span class="timestamp">[2022-05-24 Tue]</span></span>](#org4a9a878)
- [Version 0.6.1 <span class="timestamp-wrapper"><span class="timestamp">[2022-03-26 Sat]</span></span>](#org61a3852)
- [Version 0.6.0 <span class="timestamp-wrapper"><span class="timestamp">[2022-03-26 Sat]</span></span>](#orgda285b7)
- [Version 0.5.5 <span class="timestamp-wrapper"><span class="timestamp">[2022-03-25 Fri]</span></span>](#orgb6a12a2)
- [Version 0.5.4 <span class="timestamp-wrapper"><span class="timestamp">[2022-01-27 Thu]</span></span>](#org7b65547)
- [Version 0.5.3 <span class="timestamp-wrapper"><span class="timestamp">[2022-01-24 Mon]</span></span>](#org7d79f24)
- [Version 0.5.2 <span class="timestamp-wrapper"><span class="timestamp">[2022-01-22 Sat]</span></span>](#org6f191db)
- [Version 0.5.1 <span class="timestamp-wrapper"><span class="timestamp">[2022-01-21 Fri]</span></span>](#org2ae05d9)
- [Version 0.4.2 <span class="timestamp-wrapper"><span class="timestamp">[2022-01-06 Thu]</span></span>](#org580001e)
- [Version 0.4.0 <span class="timestamp-wrapper"><span class="timestamp">[2022-01-02 Sun]</span></span>](#org434338f)
- [Version 0.3.4 <span class="timestamp-wrapper"><span class="timestamp">[2022-01-01 Sat]</span></span>](#org4c7012d)
- [Version 0.3.3 <span class="timestamp-wrapper"><span class="timestamp">[2022-01-01 Sat]</span></span>](#org655ba65)
- [Version 0.3.1 <span class="timestamp-wrapper"><span class="timestamp">[2020-12-13 Sun]</span></span>](#org2c11577)
- [Version 0.3.0 <span class="timestamp-wrapper"><span class="timestamp">[2020-06-10 Wed]</span></span>](#org0117714)
- [Version 0.2.11 <span class="timestamp-wrapper"><span class="timestamp">[2019-12-29 Sun]</span></span>](#org0ef284b)
- [Version 0.2.9 <span class="timestamp-wrapper"><span class="timestamp">[2019-04-04 Thu]</span></span>](#org31f4993)
- [Version 0.2.8 <span class="timestamp-wrapper"><span class="timestamp">[2018-08-28 Tue]</span></span>](#org52cb1f0)
- [Version 0.2.7 <span class="timestamp-wrapper"><span class="timestamp">[2017-12-29 Fri]</span></span>](#org93f5350)
- [Version 0.2.6 <span class="timestamp-wrapper"><span class="timestamp">[2017-10-27 Fri]</span></span>](#org6b7de5a)
- [Version 0.2.4 <span class="timestamp-wrapper"><span class="timestamp">[2017-05-23 Tue]</span></span>](#org153576f)
- [Version 0.2.3 <span class="timestamp-wrapper"><span class="timestamp">[2017-05-08 Mon]</span></span>](#org2302a13)
- [Version 0.2.2 <span class="timestamp-wrapper"><span class="timestamp">[2017-05-08 Mon]</span></span>](#org386d2b5)


<a id="org99202c8"></a>

# Version 1.0.0 <span class="timestamp-wrapper"><span class="timestamp">[2025-12-28 Sun]</span></span>

-   Bug fixes.
-   Numeric default post-digits changed from 0 to 4 so BigDecimal can be distinguished from Integers.
-   README more readable with above fix.
-   Documentation improvements.
-   CHANGELOG added.


<a id="orgbe3a609"></a>

# Version 0.9.9 <span class="timestamp-wrapper"><span class="timestamp">[2025-03-19 Wed]</span></span>

-   bug fixes

-   No notable changes.


<a id="org4574465"></a>

# Version 0.9.8 <span class="timestamp-wrapper"><span class="timestamp">[2024-12-31 Tue]</span></span>

-   bug fixes

-   No notable changes.


<a id="org20e1d3c"></a>

# Version 0.9.7 <span class="timestamp-wrapper"><span class="timestamp">[2024-12-26 Thu]</span></span>

-   bug fixes

-   No notable changes


<a id="org31e8a65"></a>

# Version 0.9.5 <span class="timestamp-wrapper"><span class="timestamp">[2023-11-07 Tue]</span></span>

-   Raise FatTable::NoTable exception when no table can be formed from the input.
-   Ingore org rows with the wrong number of columns.


<a id="org842f384"></a>

# Version 0.9.3 <span class="timestamp-wrapper"><span class="timestamp">[2023-05-24 Wed]</span></span>

-   Bug fixes


<a id="orgf156f54"></a>

# Version 0.9.2 <span class="timestamp-wrapper"><span class="timestamp">[2023-05-22 Mon]</span></span>

-   Bug fixes


<a id="org2a66ab7"></a>

# Version 0.9.1 <span class="timestamp-wrapper"><span class="timestamp">[2023-05-22 Mon]</span></span>

-   Bug fixes


<a id="orgb45c20a"></a>

# Version 0.9.0 <span class="timestamp-wrapper"><span class="timestamp">[2023-05-22 Mon]</span></span>

-   Bug fixes


<a id="org5aaa371"></a>

# Version 0.8.0 <span class="timestamp-wrapper"><span class="timestamp">[2023-04-20 Thu]</span></span>

-   Changed the API to allow explicit column typing and tolerance designation with keyword args such as `head1: 'num~'` to make `head1` column be typed as numeric (the `num` part) but tolerant (the `~`)


<a id="org426e756"></a>

# Version 0.7.0 <span class="timestamp-wrapper"><span class="timestamp">[2023-04-02 Sun]</span></span>

-   Bug fixes


<a id="orgbea8e5d"></a>

# Version 0.6.6 <span class="timestamp-wrapper"><span class="timestamp">[2023-01-09 Mon]</span></span>

-   Changed the default number of post-decimal digits to 0 for Numeric,


<a id="orgab9a591"></a>

# Version 0.6.3 <span class="timestamp-wrapper"><span class="timestamp">[2022-06-04 Sat]</span></span>

-   Allow select to set new column to a constant,
-   Allow select string expression to signal literal string with a leading colon, since string constants are now allowed; otherwise eval the string.
-   Added day-of-week to org-formatted dates just like `org-mode`


<a id="org4a9a878"></a>

# Version 0.6.2 <span class="timestamp-wrapper"><span class="timestamp">[2022-05-24 Tue]</span></span>

-   Bug fixes


<a id="org61a3852"></a>

# Version 0.6.1 <span class="timestamp-wrapper"><span class="timestamp">[2022-03-26 Sat]</span></span>

-   Fixed bug in dynamic labels in footers,


<a id="orgda285b7"></a>

# Version 0.6.0 <span class="timestamp-wrapper"><span class="timestamp">[2022-03-26 Sat]</span></span>

-   Added dynamic labels in footers,


<a id="orgb6a12a2"></a>

# Version 0.5.5 <span class="timestamp-wrapper"><span class="timestamp">[2022-03-25 Fri]</span></span>

-   Better handling of aggregates for all-nil columns


<a id="org7b65547"></a>

# Version 0.5.4 <span class="timestamp-wrapper"><span class="timestamp">[2022-01-27 Thu]</span></span>

-   Aggregate function filter out all type-incompatible elements, not just nils, since tolerant columns may have such elements,
-   Make header-based formatting a higher priority than type-based formatting,


<a id="org7d79f24"></a>

# Version 0.5.3 <span class="timestamp-wrapper"><span class="timestamp">[2022-01-24 Mon]</span></span>

-   Added support for "tolerant" column types that allow non-coercable strings in non-String columns,


<a id="org6f191db"></a>

# Version 0.5.2 <span class="timestamp-wrapper"><span class="timestamp">[2022-01-22 Sat]</span></span>

-   documentation only


<a id="org2ae05d9"></a>

# Version 0.5.1 <span class="timestamp-wrapper"><span class="timestamp">[2022-01-21 Fri]</span></span>

-   changed `rng` column aggregate to `range` and return `Range(min, max)`
-   Added new methods for forming table footers based on aggregates,
-   Allow lambdas as group aggregate functions,
-   Improved handling of nils in aggregate and `order_by`,
-   Added an `order_with` method for ordering by expression,
-   Bug fixes and performance improvements,
-   Added special symbol `:omni` in `select` as short-hand for all columns,


<a id="org580001e"></a>

# Version 0.4.2 <span class="timestamp-wrapper"><span class="timestamp">[2022-01-06 Thu]</span></span>

-   bug fixes only


<a id="org434338f"></a>

# Version 0.4.0 <span class="timestamp-wrapper"><span class="timestamp">[2022-01-02 Sun]</span></span>

-   bug fixes only


<a id="org4c7012d"></a>

# Version 0.3.4 <span class="timestamp-wrapper"><span class="timestamp">[2022-01-01 Sat]</span></span>

-   minor bug fix only


<a id="org655ba65"></a>

# Version 0.3.3 <span class="timestamp-wrapper"><span class="timestamp">[2022-01-01 Sat]</span></span>

-   Added date format 'Tue, 01 Nov 2016' to be parsed as a Date.


<a id="org2c11577"></a>

# Version 0.3.1 <span class="timestamp-wrapper"><span class="timestamp">[2020-12-13 Sun]</span></span>

-   documentation only


<a id="org0117714"></a>

# Version 0.3.0 <span class="timestamp-wrapper"><span class="timestamp">[2020-06-10 Wed]</span></span>

-   gem dependency changes only


<a id="org0ef284b"></a>

# Version 0.2.11 <span class="timestamp-wrapper"><span class="timestamp">[2019-12-29 Sun]</span></span>

-   bug fixes only


<a id="org31f4993"></a>

# Version 0.2.9 <span class="timestamp-wrapper"><span class="timestamp">[2019-04-04 Thu]</span></span>

-   documentation fixes only


<a id="org52cb1f0"></a>

# Version 0.2.8 <span class="timestamp-wrapper"><span class="timestamp">[2018-08-28 Tue]</span></span>

-   No notable changes


<a id="org93f5350"></a>

# Version 0.2.7 <span class="timestamp-wrapper"><span class="timestamp">[2017-12-29 Fri]</span></span>

-   Minor bug fixes and performance improvements


<a id="org6b7de5a"></a>

# Version 0.2.6 <span class="timestamp-wrapper"><span class="timestamp">[2017-10-27 Fri]</span></span>

-   Added recognition of American-style dates
-   Allows + or negative signs before numbers
-   Added `ivars` that can be set in `before_hook` and `after_hook`
-   Allowed American-order date 'mm-dd-yyyy' to be parsed


<a id="org153576f"></a>

# Version 0.2.4 <span class="timestamp-wrapper"><span class="timestamp">[2017-05-23 Tue]</span></span>

-   Added instance variables to ft\_console


<a id="org2302a13"></a>

# Version 0.2.3 <span class="timestamp-wrapper"><span class="timestamp">[2017-05-08 Mon]</span></span>

-   No notable changes


<a id="org386d2b5"></a>

# Version 0.2.2 <span class="timestamp-wrapper"><span class="timestamp">[2017-05-08 Mon]</span></span>

-   Initial release
